2018/hash-table.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-03-07 周日 15:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>散列表的简单实现</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">散列表的简单实现</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1613a7d">1. 前言</a></li>
<li><a href="#orgdba7f00">2. 概念</a></li>
<li><a href="#org389b0db">3. 散列函数</a></li>
<li><a href="#org742e92b">4. 冲突</a></li>
<li><a href="#org8e0acd0">5. 分离链接法</a></li>
<li><a href="#org2e9a01d">6. 简单的实现</a></li>
<li><a href="#org81a4632">7. 结语</a></li>
<li><a href="#org60a6401">8. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1613a7d" class="outline-2">
<h2 id="org1613a7d"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
当初学数据结构的时候，只有列表、栈、队列和树跟着书上的代码敲过一次。
</p>

<p>
以致于后来看到散列表的时候，都忘记了它的实现方式，只感觉 O(1) 的插入、删除和查找操作很神奇。
</p>

<p>
前几天，终于又重新翻开了书，研究了一下散列表的实现方式，发现，好像还挺简单的 @_@
</p>
</div>
</div>

<div id="outline-container-orgdba7f00" class="outline-2">
<h2 id="orgdba7f00"><span class="section-number-2">2</span> 概念</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
In computing, a hash table (hash map) is a data structure that implements an associative array abstract data type, a structure that can map keys to values.
A hash table uses a hash function to compute an index into an array of buckets or slots, from which the desired value can be found.(<a href="https://en.wikipedia.org/wiki/Hash_table">Hash table</a>)
</p>
</blockquote>

<p>
上面这段英文是摘自维基百科的对散列表的定义，可以看到，散列表的英文表达为 <code>Hash table</code>, 音译过来的话，就是国内常用的 <b>哈希表</b> 了。
</p>

<p>
简单来说，散列表可以通过 <b>散列函数</b> 来建立 <b>键</b> 到 <b>值</b> 的一个 <b>映射</b>, 保存这些值的通常是一个数组（表），因而这个数据结构被叫做 <b>散列表</b>.
</p>

<p>
大多数情况下，数组不需要我们自己来实现，因为主流编程语言基本上都直接支持数组或类似数组的结构，因此，实现散列表的关键就落在了 <b>散列函数</b> 上。
</p>
</div>
</div>

<div id="outline-container-org389b0db" class="outline-2">
<h2 id="org389b0db"><span class="section-number-2">3</span> 散列函数</h2>
<div class="outline-text-2" id="text-3">
<p>
散列函数的作用是：通过一系列的计算来将 <b>键</b> 映射到 <b>表</b> 的某一个位置上，然后通过那个位置来存储键对应的 <b>值</b>.
</p>

<p>
一个简单的想法是：通过一系列的计算将 <b>键</b> 转换为一个 <b>整数</b>, 然后用这个 <b>整数</b> 来模 <b>表的大小</b>, 得到的 <b>余数</b> 就是该键映射到表中的位置：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">table</span>[<span class="org-builtin">hash</span>(key) % table.size()] = value;
</pre>
</div>

<p>
在高级语言中，你可以直接把一个对象的 <b>Hash</b> 方法当做散列函数使用：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-keyword">import</span> ctypes
&gt;&gt;&gt; ctypes.c_size_t(<span class="org-builtin">hash</span>(<span class="org-string">'key'</span>)).value
2932490076
&gt;&gt;&gt; ctypes.c_size_t(<span class="org-builtin">hash</span>(<span class="org-string">'key'</span>)).value
2932490076
&gt;&gt;&gt; ctypes.c_size_t(<span class="org-builtin">hash</span>(<span class="org-string">'key'</span>)).value
2932490076
</pre>
</div>

<p>
对于 <code>C</code> 语言，可以参考《数据结构与算法分析 - C 语言描述》中的一个例子：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">Index</span> <span class="org-function-name">Hash</span>(<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">key</span>, <span class="org-type">int</span> <span class="org-variable-name">TableSize</span>) {
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">HashVal</span> = 0;

  <span class="org-keyword">while</span> (*Key != <span class="org-string">'\0'</span>) {
    HashVal = (HashVal &lt;&lt; 5) + *Key++;
  }

  <span class="org-keyword">return</span> HashVal % TableSize;
}
</pre>
</div>


<p>
由于散列函数的具体实现我目前还只是 <b>只知其用法而不知其原理</b> 的状态，因此和实现散列函数相关的内容就到此结束，如果你有兴趣，可以到网上找找相关资料。
</p>
</div>
</div>

<div id="outline-container-org742e92b" class="outline-2">
<h2 id="org742e92b"><span class="section-number-2">4</span> 冲突</h2>
<div class="outline-text-2" id="text-4">
<p>
确定了散列函数后还需要解决的一个问题是：冲突 - 两个不同的键经过散列函数计算后得到了相同的值。
</p>

<p>
冲突的产生会受到 <b>表的大小</b> 的影响：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">TableSize</th>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Index</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>10</code></td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>1</code></td>
</tr>

<tr>
<td class="org-left"><code>10</code></td>
<td class="org-left"><code>11</code></td>
<td class="org-left"><code>1</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>20</code></td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>1</code></td>
</tr>

<tr>
<td class="org-left"><code>20</code></td>
<td class="org-left"><code>11</code></td>
<td class="org-left"><code>11</code></td>
</tr>
</tbody>
</table>

<p>
选择一个大一点的表可以缓解这一问题，但是过大的表会造成内存的浪费，因为散列函数计算的值可能会较为密集的分布在某一区间，虽然可以通过 <b>散列函数的选择</b> 来缓解这一问题，但是依然可能会有冲突的产生。
</p>

<p>
<b>PS:</b> 表的大小最好选择为 <b>质数</b>.
</p>

<p>
既然无法完全避免冲突，那么就只好寻找一个解决冲突的方法，为了简单，这里选择了 <b>分离链接法</b>, 更多的解决方法可以参考 <a href="https://en.wikipedia.org/wiki/Hash_table#Collision_resolution">Collision resolution - Wikipedia</a>.
</p>
</div>
</div>

<div id="outline-container-org8e0acd0" class="outline-2">
<h2 id="org8e0acd0"><span class="section-number-2">5</span> 分离链接法</h2>
<div class="outline-text-2" id="text-5">
<p>
分离链接法解决冲突的办法是：将散列到同一个值的所有元素保存到一个 <b>表</b> 中，而数组中保存的则是这些表的 <b>表头</b>.
</p>

<p>
同时，为了方便，可以为这些表设置一个空的头结点：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">array</span> = [Node(<span class="org-constant">None</span>, <span class="org-constant">None</span>) <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(23)]
</pre>
</div>

<p>
保存元素的结构可以通过 <b>Key</b> 字段来保存散列到该值的键，通过 <b>Val</b> 字段来保存该键对应的值：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Node</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, key val):
        <span class="org-keyword">self</span>.key = key
        <span class="org-keyword">self</span>.val = val
        <span class="org-keyword">self</span>.<span class="org-builtin">next</span> = <span class="org-constant">None</span>
</pre>
</div>

<p>
这样一来，产生冲突的时候，就可以将产生冲突的新建保存到链表头部或尾部。
</p>
</div>
</div>

<div id="outline-container-org2e9a01d" class="outline-2">
<h2 id="org2e9a01d"><span class="section-number-2">6</span> 简单的实现</h2>
<div class="outline-text-2" id="text-6">
<p>
通过 <code>Python</code> 实现的一个简单的散列表：
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">-*- coding: utf-8 -*-</span>

<span class="org-keyword">import</span> ctypes


<span class="org-keyword">class</span> <span class="org-type">HashTable</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">class</span> <span class="org-type">Node</span>(<span class="org-builtin">object</span>):
        <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, key, val):
            <span class="org-keyword">self</span>.key = key
            <span class="org-keyword">self</span>.val = val
            <span class="org-keyword">self</span>.<span class="org-builtin">next</span> = <span class="org-constant">None</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, table_size):
        <span class="org-keyword">self</span>.table_size = table_size
        <span class="org-keyword">self</span>.table = [HashTable.Node(<span class="org-constant">None</span>, <span class="org-constant">None</span>) <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(table_size)]

    <span class="org-keyword">def</span> <span class="org-function-name">_hash</span>(<span class="org-keyword">self</span>, key):
        <span class="org-keyword">return</span> ctypes.c_size_t(<span class="org-builtin">hash</span>(key)).value % <span class="org-keyword">self</span>.table_size

    <span class="org-keyword">def</span> <span class="org-function-name">__setitem__</span>(<span class="org-keyword">self</span>, key, val):
        <span class="org-variable-name">node</span> = <span class="org-keyword">self</span>.table[<span class="org-keyword">self</span>._hash(key)]
        <span class="org-keyword">while</span> node.<span class="org-builtin">next</span>:
            <span class="org-variable-name">node</span> = node.<span class="org-builtin">next</span>
            <span class="org-keyword">if</span> node.key == key:
                <span class="org-variable-name">node.val</span> = val
                <span class="org-keyword">break</span>
        <span class="org-keyword">else</span>:
            node.<span class="org-builtin">next</span> = HashTable.Node(key, val)

    <span class="org-keyword">def</span> <span class="org-function-name">__getitem__</span>(<span class="org-keyword">self</span>, key):
        <span class="org-variable-name">node</span> = <span class="org-keyword">self</span>.table[<span class="org-keyword">self</span>._hash(key)]
        <span class="org-keyword">while</span> node.<span class="org-builtin">next</span>:
            <span class="org-variable-name">node</span> = node.<span class="org-builtin">next</span>
            <span class="org-keyword">if</span> node.key == key:
                <span class="org-keyword">return</span> node.val
        <span class="org-keyword">return</span> <span class="org-constant">None</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__delitem__</span>(<span class="org-keyword">self</span>, key):
        <span class="org-variable-name">node</span> = <span class="org-keyword">self</span>.table[<span class="org-keyword">self</span>._hash(key)]
        <span class="org-variable-name">prev</span>, <span class="org-variable-name">curr</span> = node, node.<span class="org-builtin">next</span>
        <span class="org-keyword">while</span> curr:
            <span class="org-keyword">if</span> curr.key == key:
                prev.<span class="org-builtin">next</span> = curr.<span class="org-builtin">next</span>
                <span class="org-keyword">break</span>
            <span class="org-variable-name">prev</span>, <span class="org-variable-name">curr</span> = curr, curr.<span class="org-builtin">next</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__repr__</span>(<span class="org-keyword">self</span>):
        <span class="org-variable-name">dt</span> = <span class="org-builtin">dict</span>()
        <span class="org-keyword">for</span> node <span class="org-keyword">in</span> <span class="org-keyword">self</span>.table:
            <span class="org-keyword">while</span> node.<span class="org-builtin">next</span>:
                <span class="org-variable-name">node</span> = node.<span class="org-builtin">next</span>
                <span class="org-variable-name">dt</span>[node.key] = node.val
        <span class="org-keyword">return</span> <span class="org-builtin">repr</span>(dt)
</pre>
</div>

<p>
测试：
</p>
<div class="org-src-container">
<pre class="src src-python">In [1]: <span class="org-keyword">from</span> hashtbl <span class="org-keyword">import</span> HashTable

In [2]: <span class="org-variable-name">ht</span> = HashTable(27)

In [3]: <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(30):
   ...:     <span class="org-variable-name">ht</span>[i] = i
   ...:

In [4]: <span class="org-builtin">sum</span>(<span class="org-builtin">range</span>(30)) == <span class="org-builtin">sum</span>([ht[i] <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(30)])
Out[4]: <span class="org-constant">True</span>

In [5]: <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(0, 30, 2):
   ...:     <span class="org-variable-name">ht</span>[i] = i * i
   ...:

In [6]: <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(1, 30, 2):
   ...:     <span class="org-keyword">del</span> ht[i]
   ...:

In [7]: ht
Out[7]: {0: 0, 28: 784, 2: 4, 4: 16, 6: 36, 8: 64, 10: 100, 12: 144, 14: 196, 16: 256, 18: 324, 20: 400, 22: 484, 24: 576, 26: 676}
</pre>
</div>
</div>
</div>

<div id="outline-container-org81a4632" class="outline-2">
<h2 id="org81a4632"><span class="section-number-2">7</span> 结语</h2>
<div class="outline-text-2" id="text-7">
<p>
通过上面那个简陋的实现可以看到，只有有了现成的散列函数和冲突解决方法，散列表的实现就不是很难。
</p>

<p>
散列表的真正重点在于散列函数和冲突解决，这篇博客对于这两点的涉及很少，有兴趣的可以去了解一下。
</p>

<p>
另外，这是 Java HashMap 的源码链接，可以学习一下： <a href="http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d/src/share/classes/java/util/HashMap.java">OpenJDK/jdk8/jdk8/jdk</a>.
</p>
</div>
</div>

<div id="outline-container-org60a6401" class="outline-2">
<h2 id="org60a6401"><span class="section-number-2">8</span> 参考链接</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="http://www.nowamagic.net/academy/part/30/185/">数据结构：查找篇 &#x2013; 简明现代魔法</a></li>
<li><a href="https://en.wikipedia.org/wiki/Hash_table">Hash table - Wikipedia</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<script src="https://utteranc.es/client.js"
        repo="rgb-24bit/blog"
        issue-term="pathname"
        theme="boxy-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
